export const messages = {
  CSV出力: "CSV出力",
  arg0にはarg1より未来の日付を入力してください: (arg0: string, arg1: string) =>
    `${arg0}には${arg1}より未来の日付を入力してください`,
  arg0にはarg1より過去の日付を入力してください: (arg0: string, arg1: string) =>
    `${arg0}には${arg1}より過去の日付を入力してください`,
  arg0の削除: (arg0: string) => `${arg0}の削除`,
  arg0の形式が正しくありません: (arg0: string) =>
    `${arg0}の形式が正しくありません`,
  arg0の追加: (arg0: string) => `${arg0}の追加`,
  arg0を入力してください: (arg0: string) => `${arg0}を入力してください`,
  arg0を追加できません: (arg0: string) => `${arg0}を追加できません`,
  "pulp-scheduling": "pulp-scheduling",
  "pulp-schedulingの不具合やデータの破損などにより作成できない可能性があります（arg0）":
    (arg0: string) =>
      `pulp-schedulingの不具合やデータの破損などにより作成できない可能性があります（${arg0}）`,
  "pulp-schedulingの不具合や条件の誤りなどにより特定できない可能性があります（arg0）":
    (arg0: string) =>
      `pulp-schedulingの不具合や条件の誤りなどにより特定できない可能性があります（${arg0}）`,
  version: "v0.2.2",
  このarg0を削除します: (arg0: string) => `この${arg0}を削除します`,
  この期間に他の期間からデータと条件をインポートします:
    "この期間に他の期間からデータと条件をインポートします",
  すべての条件: "すべての条件",
  やり直す: "やり直す",
  インポート: "インポート",
  グループ: "グループ",
  グループがありません: "グループがありません",
  グループに所属する職員: "グループに所属する職員",
  グループ名: "グループ名",
  他の期間からデータと条件をインポート: "他の期間からデータと条件をインポート",
  他の期間からデータと条件をインポートできません:
    "他の期間からデータと条件をインポートできません",
  以下の勤務表の割り当ても削除されます: "以下の勤務表の割り当ても削除されます",
  以下の勤務表も削除されます: "以下の勤務表も削除されます",
  以下の条件により勤務表を作成できませんでした:
    "以下の条件により勤務表を作成できませんでした",
  以下の条件も削除されます: "以下の条件も削除されます",
  "作成中...": "作成中...",
  保存: "保存",
  元に戻す: "元に戻す",
  削除: "削除",
  割り当て数上限: "割り当て数上限",
  割り当て数下限: "割り当て数下限",
  割り当て職員数上限: "割り当て職員数上限",
  割り当て職員数下限: "割り当て職員数下限",
  勤務: "勤務",
  勤務arg0: (arg0: number) => `勤務${arg0}`,
  勤務がありません: "勤務がありません",
  勤務の連続日数の上限: "勤務の連続日数の上限",
  勤務の連続日数の下限: "勤務の連続日数の下限",
  勤務の間隔日数の上限: "勤務の間隔日数の上限",
  勤務の間隔日数の下限: "勤務の間隔日数の下限",
  勤務名: "勤務名",
  勤務表: "勤務表",
  勤務表arg0: (arg0: number) => `勤務表${arg0}`,
  勤務表を作成できない原因となる条件を特定:
    "勤務表を作成できない原因となる条件を特定",
  勤務表を作成できない原因となる条件を特定できませんでした:
    "勤務表を作成できない原因となる条件を特定できませんでした",
  "勤務表を作成できない原因となる条件を特定中...":
    "勤務表を作成できない原因となる条件を特定中...",
  勤務表を作成できませんでした: "勤務表を作成できませんでした",
  有効: "有効",
  有効な他の期間がありません: "有効な他の期間がありません",
  期間: "期間",
  期間の勤務にグループから割り当てる職員数の上限:
    "期間の勤務にグループから割り当てる職員数の上限",
  期間の勤務にグループから割り当てる職員数の下限:
    "期間の勤務にグループから割り当てる職員数の下限",
  "期間中のすべての勤務表、職員、勤務、グループ、条件も削除されます":
    "期間中のすべての勤務表、職員、勤務、グループ、条件も削除されます",
  条件を満たす勤務表が存在しません: "条件を満たす勤務表が存在しません",
  終了日: "終了日",
  職員: "職員",
  職員がいません: "職員がいません",
  職員が所属するグループ: "職員が所属するグループ",
  職員の勤務の割り当て数の上限: "職員の勤務の割り当て数の上限",
  職員の勤務の割り当て数の下限: "職員の勤務の割り当て数の下限",
  職員の期間に割り当てない勤務: "職員の期間に割り当てない勤務",
  職員の期間に割り当てる勤務: "職員の期間に割り当てる勤務",
  職員名: "職員名",
  自動作成: "自動作成",
  追加: "追加",
  連続日数上限: "連続日数上限",
  連続日数下限: "連続日数下限",
  連続禁止勤務並び: "連続禁止勤務並び",
  選択した期間から次のデータと条件をインポートします:
    "選択した期間から次のデータと条件をインポートします",
  閉じる: "閉じる",
  開始日: "開始日",
  間隔日数上限: "間隔日数上限",
  間隔日数下限: "間隔日数下限",
  "（arg0未入力）": (arg0: string) => `（${arg0}未入力）`,
};

export const m = messages;
